Repository: Liis17/BarkFluff
Catalog: Mac/Barkfluff/Barkfluff/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, ru, zh_hans

# settings.security.storage.switch_confirm.title
source: Switch storage?
de: Speicher wechseln?
es: ¿Cambiar el almacenamiento?
ru: Переключить хранилище?
zh_hans: 切换存储方式？

# settings.security.two_fa.footer
source: When 2FA is enabled, you will need to enter a code from your authenticator app on every sign-in
de: Wenn 2FA aktiviert ist, musst du bei jeder Anmeldung einen Code aus deiner Authenticator-App eingeben
es: Cuando la 2FA está activada, deberás introducir un código de tu app autenticadora en cada inicio de sesión
ru: При включении 2FA вам потребуется вводить код из приложения-аутентификатора при каждом входе
zh_hans: 启用二步验证后，每次登录都需要输入认证器应用中的验证码

# settings.security.two_fa.section
source: Two-factor authentication
de: Zwei-Faktor-Authentifizierung
es: Autenticación en dos pasos
ru: Двухфакторная аутентификация
zh_hans: 两步验证

# settings.security.two_fa.toggle
source: Two-factor authentication
de: Zwei-Faktor-Authentifizierung
es: Autenticación en dos pasos
ru: Двухфакторная аутентификация
zh_hans: 两步验证

# settings.sessions.current_badge
source: Current
de: Aktuell
es: Actual
ru: Текущая
zh_hans: 当前

# settings.sessions.empty
source: No active sessions
de: Keine aktiven Sitzungen
es: No hay sesiones activas
ru: Нет активных сессий
zh_hans: 没有活动会话

# settings.sessions.error.load
source: Failed to load sessions
de: Sitzungen konnten nicht geladen werden
es: No se pudieron cargar las sesiones
ru: Не удалось загрузить сессии
zh_hans: 无法加载会话

# settings.sessions.error.terminate
source: Failed to terminate session
de: Sitzung konnte nicht beendet werden
es: No se pudo finalizar la sesión
ru: Не удалось завершить сессию
zh_hans: 无法终止会话

# settings.sessions.footer
source: If you see unfamiliar devices, terminate the session and change your password
de: Wenn du unbekannte Geräte siehst, beende die Sitzung und ändere dein Passwort
es: Si ves dispositivos desconocidos, cierra la sesión y cambia tu contraseña
ru: Если вы видите незнакомые устройства, завершите сессию и смените пароль
zh_hans: 如果看到陌生设备，请终止会话并修改密码

# settings.sessions.loading
source: Loading sessions…
de: Sitzungen werden geladen…
es: Cargando sesiones…
ru: Загрузка сессий...
zh_hans: 正在加载会话…

# settings.sessions.section
source: Active sessions
de: Aktive Sitzungen
es: Sesiones activas
ru: Активные сессии
zh_hans: 活动会话

# settings.sessions.terminate
source: Terminate
de: Beenden
es: Terminar
ru: Завершить
zh_hans: 终止

# settings.sessions.terminate_others
source: Terminate all except current
de: Alle außer der aktuellen beenden
es: Terminar todas excepto la actual
ru: Завершить все кроме текущей
zh_hans: 终止除当前外的所有会话

# settings.sessions.unknown_device
source: Unknown device
de: Unbekanntes Gerät
es: Dispositivo desconocido
ru: Неизвестное устройство
zh_hans: 未知设备

# settings.token_storage.error.migration %@
source: Migration error: %@
de: Migrationsfehler: %@
es: Error de migración: %@
ru: Ошибка миграции: %@
zh_hans: 迁移错误：%@

# settings.token_storage.error.no_container
source: DependencyContainer is not configured
de: DependencyContainer ist nicht konfiguriert
es: DependencyContainer no está configurado
ru: DependencyContainer не настроен
zh_hans: DependencyContainer 未配置

# sidebar.empty.description
source: Start a conversation or create a group
de: Beginne ein Gespräch oder erstelle eine Gruppe
es: Inicia una conversación o crea un grupo
ru: Начните диалог или создайте группу
zh_hans: 开始对话或创建群组

# sidebar.empty.title
source: No chats
de: Keine Chats
es: Sin chats
ru: Нет чатов
zh_hans: 没有聊天

# sidebar.search.prompt
source: Search chats
de: Chats durchsuchen
es: Buscar chats
ru: Поиск чатов
zh_hans: 搜索聊天

# sidebar.section.messages
source: Messages
de: Nachrichten
es: Mensajes
ru: Сообщения
zh_hans: 消息

# token_storage.keychain.desc
source: Encrypted storage in the system Keychain. May prompt for a password at launch.
de: Verschlüsselte Speicherung im System-Keychain. Kann beim Start ein Passwort verlangen.
es: Almacenamiento cifrado en el Keychain del sistema. Puede solicitar contraseña al iniciar.
ru: Зашифрованное хранение в системном Keychain. Может запрашивать пароль при запуске.
zh_hans: 在系统 Keychain 中加密存储。启动时可能要求输入密码。

# token_storage.keychain.warning
source: macOS may prompt for the keychain password when launching the app.
de: macOS kann beim Start der App nach dem Keychain-Passwort fragen.
es: macOS puede solicitar la contraseña del keychain al iniciar la app.
ru: macOS может запрашивать пароль keychain при запуске приложения.
zh_hans: 启动应用时，macOS 可能会要求输入 keychain 密码。

# token_storage.keychain_icloud.desc
source: Sync tokens across devices via iCloud. Requires a password at launch.
de: Synchronisation der Token zwischen Geräten über iCloud. Erfordert ein Passwort beim Start.
es: Sincronización de tokens entre dispositivos vía iCloud. Requiere contraseña al iniciar.
ru: Синхронизация токенов между устройствами через iCloud. Требует пароль при запуске.
zh_hans: 通过 iCloud 在设备间同步令牌。启动时需要密码。

# token_storage.keychain_icloud.warning
source: macOS will prompt for the keychain password at launch. Sign-in to iCloud is required.
de: macOS verlangt beim Start das Keychain-Passwort. iCloud-Anmeldung erforderlich.
es: macOS solicitará la contraseña del keychain al iniciar. Requiere sesión en iCloud.
ru: macOS будет запрашивать пароль keychain при запуске. Требуется вход в iCloud.
zh_hans: macOS 在启动时会要求输入 keychain 密码。需要登录 iCloud。

# token_storage.user_defaults.desc
source: Stored within the app. Safe for most cases. No password prompt at launch.
de: Speicherung innerhalb der App. Für die meisten Fälle sicher. Keine Passwortabfrage beim Start.
es: Almacenamiento en la app. Seguro en la mayoría de los casos. Sin solicitud de contraseña al iniciar.
ru: Хранение в памяти приложения. Безопасно для большинства случаев. Не требует пароль при запуске.
zh_hans: 存储在应用内。适用于大多数情况。启动时不需要密码。

# token_storage.user_defaults.name
source: UserDefaults (recommended)
de: UserDefaults (empfohlen)
es: UserDefaults (recomendado)
ru: UserDefaults (рекомендуется)
zh_hans: UserDefaults（推荐）

# upload_file_type.chat_picture
source: Chat covers
de: Chat-Cover
es: Portadas de chat
ru: Обложки чатов
zh_hans: 聊天封面

# upload_file_type.message_document
source: Documents
de: Dokumente
es: Documentos
ru: Документы
zh_hans: 文档

# upload_file_type.message_image
source: Images
de: Bilder
es: Imágenes
ru: Изображения
zh_hans: 图像

# upload_file_type.message_sticker
source: Stickers
de: Sticker
ru: Стикеры
zh_hans: 贴纸

# upload_file_type.message_voice
source: Voice messages
de: Sprachnachrichten
es: Mensajes de voz
ru: Голосовые
zh_hans: 语音消息

# upload_file_type.unknown
source: Other
de: Sonstige
es: Otros
ru: Прочее
zh_hans: 其他

# upload_file_type.user_avatar
source: Avatars
de: Avatare
es: Avatares
ru: Аватары
zh_hans: 头像

# upload_file_type.user_poster
source: Profile posters
de: Profilposter
es: Pósteres de perfil
ru: Постеры профиля
zh_hans: 个人资料海报

# user_profile.action.send_message
source: Send message
de: Nachricht senden
es: Enviar mensaje
ru: Отправить сообщение
zh_hans: 发送消息

# user_profile.close
source: Close
de: Schließen
es: Cerrar
ru: Закрыть
zh_hans: 关闭

# user_profile.copy
source: Copy
de: Kopieren
es: Copiar
ru: Скопировать
zh_hans: 复制

# user_profile.error.cannot_resolve_user
source: Failed to determine the interlocutor
de: Gesprächspartner konnte nicht ermittelt werden
es: No se pudo identificar al interlocutor
ru: Не удалось определить собеседника
zh_hans: 无法识别对话用户

# user_profile.group_members.label
source: Members
de: Mitglieder
es: Miembros
ru: Участники
zh_hans: 成员

# user_profile.group_members.role.owner
source: Owner
de: Eigentümer
es: Propietario
ru: Владелец
zh_hans: 群主

# user_profile.group_members.show_all
source: Show all
de: Alle anzeigen
es: Mostrar todos
ru: Показать всех
zh_hans: 显示全部

# user_profile.group_members.show_all_with_count %lld
source: Show all (%lld)
de: Alle anzeigen (%lld)
es: Mostrar todos (%lld)
ru: Показать всех (%lld)
zh_hans: 显示全部（%lld）

# user_profile.group_members.title %lld
source: Members (%lld)
de: Mitglieder (%lld)
es: Miembros (%lld)
ru: Участники (%lld)
zh_hans: 成员（%lld）

# user_profile.info.badges
source: Awards
de: Auszeichnungen
es: Insignias
ru: Награды
zh_hans: 徽章

# user_profile.info.bio
source: About
de: Über
es: Acerca de
ru: О себе
zh_hans: 关于

# user_profile.info.registered
source: Registered
de: Registriert
es: Registrado
ru: Дата регистрации
zh_hans: 注册时间

# user_profile.info.storage
source: Storage
de: Speicher
es: Almacenamiento
ru: Хранилище
zh_hans: 存储

# user_profile.info.user_id
source: User ID
de: Benutzer-ID
es: ID de usuario
ru: ID пользователя
zh_hans: 用户 ID

# user_profile.members_count %lld
source: %lld members
de: %lld Mitglieder
es: %lld miembros
ru: %lld участников
zh_hans: %lld 位成员

# user_profile.shared_docs.untitled
source: Document
de: Dokument
es: Documento
ru: Документ
zh_hans: 文档

# user_profile.shared_media.empty.documents
source: No shared documents in this chat yet
de: In diesem Chat wurden noch keine Dokumente geteilt
es: Aún no hay documentos compartidos en este chat
ru: В этом чате пока нет общих документов
zh_hans: 此聊天中暂无共享文档

# user_profile.shared_media.empty.documents_short
source: No files
de: Keine Dateien
es: Sin archivos
ru: Нет файлов
zh_hans: 没有文件

# user_profile.shared_media.empty.media
source: No shared photos or videos in this chat yet
de: In diesem Chat wurden noch keine Fotos oder Videos geteilt
es: Aún no hay fotos ni vídeos compartidos en este chat
ru: В этом чате пока нет общих фото и видео
zh_hans: 此聊天中暂无共享的照片或视频

# user_profile.shared_media.empty.media_short
source: No media
de: Keine Medien
es: Sin medios
ru: Нет медиа
zh_hans: 没有媒体

# user_profile.shared_media.empty.title
source: Empty
de: Leer
es: Vacío
ru: Пусто
zh_hans: 空

# user_profile.shared_media.filter.documents
source: Documents
de: Dokumente
es: Documentos
ru: Документы
zh_hans: 文档

# user_profile.shared_media.filter.media
source: Media
de: Medien
es: Medios
ru: Медиа
zh_hans: 媒体

# user_profile.shared_media.load_more
source: Load more
de: Mehr laden
es: Cargar más
ru: Загрузить ещё
zh_hans: 加载更多

# user_profile.shared_media.picker.type
source: Type
de: Typ
es: Tipo
ru: Тип
zh_hans: 类型

# user_profile.shared_media.title
source: Attachments
de: Anhänge
es: Adjuntos
ru: Вложения
zh_hans: 附件

# user_profile.title.group
source: Group info
de: Gruppeninfo
es: Información del grupo
ru: Информация о группе
zh_hans: 群组信息

# user_profile.title.user
source: Profile
de: Profil
es: Perfil
ru: Профиль
zh_hans: 个人资料

# user_search.empty.description
source: Try changing the query
de: Versuche, die Suche zu ändern
es: Prueba a cambiar la búsqueda
ru: Попробуйте изменить запрос
zh_hans: 尝试更改搜索内容

# user_search.empty.title
source: Nothing found
de: Nichts gefunden
es: Sin resultados
ru: Ничего не найдено
zh_hans: 未找到结果

# user_search.idle.description
source: Enter a name or username to search
de: Gib einen Namen oder Benutzernamen ein, um zu suchen
es: Escribe un nombre o usuario para buscar
ru: Введите имя или username для поиска
zh_hans: 输入姓名或用户名进行搜索

# user_search.idle.title
source: Search users
de: Benutzer suchen
es: Buscar usuarios
ru: Поиск пользователей
zh_hans: 搜索用户

# user_search.prompt
source: Name or username
de: Name oder Benutzername
es: Nombre o usuario
ru: Имя или username
zh_hans: 姓名或用户名

# user_search.title
source: Search
de: Suchen
es: Buscar
ru: Поиск
zh_hans: 搜索

# auth.login.otp
source: 2FA code
es: Código 2FA
ru: Код 2FA
zh_hans: 二步验证码

# auth.register.step.completion.row.email
source: Email
es: Correo
zh_hans: 邮箱

# auth.register.step.completion.row.name
source: Name
es: Nombre
ru: Имя
zh_hans: 姓名

# auth.register.step.email.placeholder
source: email@example.com
es: correo@ejemplo.com

# auth.register.step.email.title
source: Email
es: Correo
zh_hans: 邮箱

# auth.register.step.optional_suffix
source: (optional)
es: (opcional)
ru: (опционально)
zh_hans: （可选）

# conversation.attach.preview.sticker
source: Sticker
es: Stickers
ru: Стикер
zh_hans: 贴纸

# conversation.attach.preview.video
source: Video
es: Vídeo
ru: Видео
zh_hans: 视频

# conversation.emoji.category.smileys
source: Smileys
es: Emoticonos
ru: Смайлики
zh_hans: 笑脸

# conversation.status.offline
source: offline
es: desconectado
ru: не в сети
zh_hans: 离线

# conversation.status.online
source: online
es: en línea
ru: онлайн
zh_hans: 在线

# enum.theme.system
source: System
es: Sistema
ru: Системная
zh_hans: 系统

# group_chat.members.admin_placeholder %lld
source: Admin %lld
es: Administrador %lld
ru: Админ %lld
zh_hans: 管理员 %lld

# language.system
source: System
es: Sistema
ru: Системный
zh_hans: 系统

# settings.about_app.build
source: Build
es: Compilación
ru: Сборка
zh_hans: 构建

# settings.about_app.host
source: Computer name
es: Nombre del equipo
ru: Имя ПК
zh_hans: 计算机名称

# settings.about_app.name
source: Name
es: Nombre
ru: Название
zh_hans: 名称

# settings.about_app.section.system
source: System
es: Sistema
ru: Система
zh_hans: 系统

# settings.about_app.version
source: Version
es: Versión
ru: Версия
zh_hans: 版本

# settings.about_server.name
source: Name
es: Nombre
ru: Имя
zh_hans: 名称

# settings.about_server.section.services
source: Microservices
es: Microservicios
ru: Микросервисы
zh_hans: 微服务

# settings.category.cache
source: Cache
es: Caché
ru: Кеш
zh_hans: 缓存

# settings.category.cloud
source: Cloud
es: Nube
ru: Облако
zh_hans: 云

# settings.chat_folders.name.section
source: Name
es: Nombre
ru: Название
zh_hans: 名称

# upload_file_type.message_video
source: Videos
es: Vídeos
ru: Видео
zh_hans: 视频

# user_profile.group_members.role.admin
source: Admin
es: Administrador
ru: Админ
zh_hans: 管理员

# user_profile.info.chat_id
source: Chat ID
es: ID del chat
ru: ID чата
zh_hans: 聊天 ID

# auth.register.step.avatar.title
source: Avatar
ru: Аватар
zh_hans: 头像

# chat_list.title
source: Chats
ru: Чаты
zh_hans: 聊天

# commands.chats
source: Chats
ru: Чаты
zh_hans: 聊天

# common.chat
source: Chat
ru: Чат
zh_hans: 聊天

# conversation.attach.preview.audio
source: Audio
ru: Аудио
zh_hans: 音频

# conversation.input.emoji_tooltip
source: Emoji
ru: Эмодзи
zh_hans: 表情

# navigation.tab.chats
source: Chats
ru: Чаты
zh_hans: 聊天

# navigation.title.chats
source: Chats
ru: Чаты
zh_hans: 聊天

# settings.about_server.ms
source: ms
ru: мс
zh_hans: 毫秒

# settings.about_server.ping
source: Ping
ru: Пинг
zh_hans: 延迟

# settings.chat_folders.chats_count %lld
source: Chats: %lld
ru: Чатов: %lld
zh_hans: 聊天数：%lld

# upload_file_type.message_audio
source: Audio
ru: Аудио
zh_hans: 音频

# user_profile.info.storage.gb %lld
source: %lld GB
ru: %lld ГБ

# auth.register.step.completion.row.two_fa
source: 2FA
zh_hans: 二步验证

# common.ok
source: OK
zh_hans: 好
